app/controllers/meishikis_controller.rb

  def index
    @meishikis = Meishiki.all
---
SELECT "meishikis".* FROM "meishikis"

  def show
    @meishiki = Meishiki.find(params[:id])
---
SELECT "meishikis".* FROM "meishikis" WHERE "meishikis"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @meishiki = Meishiki.new(params[:meishiki])

    if @meishiki.is_sekki_defined?

    respond_to do |format|
      if @meishiki.save
---
INSERT INTO "meishikis" ("birthday", "created_at", "name", "sex", "updated_at") VALUES (?, ?, ?, ?, ?)  [["birthday", Wed, 27 Mar 2013 00:00:00 UTC +00:00], ["created_at", Wed, 27 Mar 2013 08:39:00 UTC +00:00], ["name", "test"], ["sex", "男性"], ["updated_at", Wed, 27 Mar 2013 08:39:00 UTC +00:00]]